tutorials/multiphaseEuler/wallCondensation/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    limited         cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    div(phi,alpha)  Gauss vanLeer;
    div(phir,alpha) Gauss vanLeer;

    div(alphaRhoPhi,U) Gauss linearUpwind limited;
    div(phi,U)      Gauss linearUpwind limited;

    div(alphaRhoPhi,Yi) Gauss linearUpwind limited;
    "div\(alphaRhoPhi,(h|e)\)" Gauss linearUpwind limited;
    div(alphaRhoPhi,K) Gauss linearUpwind limited;
    div(alphaRhoPhi,(p|rho)) Gauss linearUpwind limited;
    "div\(alphaRhoPhi,(k|epsilon|omega)\)"  Gauss linearUpwind limited;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
    nRequired       yes;
}


// ************************************************************************* //
